# Python And Data Analysis (PANDAS)

In [11]:
import pandas as pd
import numpy as np

In [9]:
#Create a R like list
series = pd.Series([4,'8',8.1,-4])
print(series)
type(series)

0      4
1      8
2    8.1
3     -4
dtype: object

pandas.core.series.Series

In [3]:
#series with an explicit index
series = pd.Series([4,8,8.1,-4],index=["a","b","c","d"])
print(series)

a    4.0
b    8.0
c    8.1
d   -4.0
dtype: float64

In [ ]:
series[series<5]

In [6]:
dictionary = {"First":["Hi","Hello"],"Second": 5.4,
              "Third":-9.4,"Fourth":12}
series = pd.Series(dictionary)
print(series)

First     [Hi, Hello]
Fourth             12
Second            5.4
Third            -9.4
dtype: object

In [7]:
#series with elements of different length
series = pd.Series([["Hi","Hello"],5.4,-9.4,12],index = 
                   ["First","Second","Third","Fourth"])
print(series)

First     [Hi, Hello]
Second            5.4
Third            -9.4
Fourth             12
dtype: object

In [151]:
a=pd.Series([10,20,30,'40'])
b=pd.Series([1,2,3,'4'])
a+b

0     11
1     22
2     33
3    404
dtype: object

In [ ]:
data = {"date" : [ "December,2014", "December, 2013",
                  "December, 2012","December,2011"],
        "global_temp": [0.87,0.74,0.65,0.63]
       }
df = pd.DataFrame(data)
print(df)

In [8]:
dataframe = pd.DataFrame(np.random.randn(20,5),columns
                         = ['A','B','C','D','E'])
print(dataframe)

           A         B         C         D         E
0  -0.169937  0.916027  0.070315 -1.350920 -0.675341
1   0.591516 -0.135389  0.863132  0.047895  2.311313
2  -0.086680  0.423423  0.199112 -0.192350  1.312793
3  -1.391429  1.980628  0.765046  1.019416  1.190391
4  -2.277734 -0.725407 -0.892103  0.414968 -1.678314
5   0.331493  0.670605  2.246663 -0.565865  0.993826
6   0.208153  0.348759  0.228889 -2.614961 -1.370774
7   0.289919 -0.369947 -1.270342  1.293858  0.583245
8   1.517537  0.958912  0.143346 -0.192169 -0.291864
9  -1.788538 -0.260441 -0.143054 -0.111396 -0.303042
10 -0.638885 -0.437907 -1.043777  2.934369 -0.049027
11 -0.033251  1.134223 -0.402048 -1.267671 -1.216614
12  0.306569  0.402183 -0.361893 -1.955833  2.399559
13 -0.676394 -0.786870  0.158853  1.359277  0.018555
14 -0.149768 -0.665326  0.272788  0.556591  0.975551
15 -0.588361 -0.727863 -2.006217  0.454248 -0.879368
16  0.035568 -0.524514  0.368361 -0.235611 -0.389596
17 -1.553281 -0.072512 -0.406632  0.453556 -1.086632
18  0.354261 -0.841849 -1.467285  1.032154 -0.579338
19  0.352022  0.680287  0.028872 -0.470671  1.853758

In [ ]:
#Top 5 rows
dataframe.head()

In [ ]:
#Bottom 3 rows
dataframe.tail(n=3)

In [ ]:
#Get the summary statistics on the numeric columns
dataframe.describe()

In [ ]:
#Sort the data in the ascending order on a particular column
dataframe.sort_values(by = 'C')

In [ ]:
#Fetch only one single column
dataframe.A
dataframe['A']

In [ ]:
#Select 2nd, to 4th rows of column A
dataframe[2:5]['A']

In [ ]:
dataframe[2:5][['A','B','C']]

In [ ]:
#Get all the rows for columns A and B
dataframe[['A','B']]

In [9]:
#Get the  third, fourth , ninth and fifteenth rows of 
# first, second columns
dataframe.iloc[[2,3,8,14],[0,1]]

           A         B
2  -0.086680  0.423423
3  -1.391429  1.980628
8   1.517537  0.958912
14 -0.149768 -0.665326

In [ ]:
#For all A  > 0.5 get the values of columns A, b and C
# select A, b, C
#from dataframe
#where A> 0.5
#dataframe[condition of subsetting the row][list of columns]
dataframe[dataframe.A>0.5][['A','B','C']]

In [ ]:
#Below query is same as the above
dataframe[dataframe['A']>0.5][['A','B','C']]

In [ ]:
# For all A  > 0.5  and B > 0.3 get the values of columns A, b and C
dataframe[(dataframe.A>0.5)&(dataframe.B>0.3)][['A','B','C']]

In [12]:
df = pd.DataFrame({'class': ['a', 'a', 'b', 'b'],
                   'class_Name': ['Marker', 'Marker', 
                                  'Projector', 'Projector'],
                         'quantity':[12, 10, 3, 6],
                         'price':[120, 100, 30, 60]})
df

  class class_Name  price  quantity
0     a     Marker    120        12
1     a     Marker    100        10
2     b  Projector     30         3
3     b  Projector     60         6

In [15]:
x= df.quantity
print(x)
x-np.mean(x)

0    12
1    10
2     3
3     6
Name: quantity, dtype: int64

pandas.core.series.Series

In [13]:
#For every class find the mean of quantity and price
grouped = df.groupby('class')
grouped.mean()

       price  quantity
class
a      110.0      11.0
b       45.0       4.5

In [14]:
df.groupby('class').mean()

       price  quantity
class
a      110.0      11.0
b       45.0       4.5

In [15]:
#For every class find the sum of quantity and mean of price
df.groupby('class').agg({'quantity':np.sum,'price':np.mean})

       quantity  price
class
a            22    110
b             9     45

In [ ]:
#For every class find the mean, sum and std of price 
df[["price","class"]].groupby('class').agg(["mean",
                                            "sum","std"])

In [ ]:
#For every class find the mean, sum and std of price and quantity
df.groupby('class').agg(["mean","sum","std"])

In [ ]:
df.groupby(['class','class_Name']).\
agg({'quantity':np.sum,'price':np.mean})

In [ ]:
#Row wise means
dataframe.apply(np.mean,axis=1)

In [ ]:
#Col wise means
dataframe.apply(np.mean,axis=0)

In [ ]:
# For every row find the mean and 
# subtract every element in that row from the mean
print(df[["quantity","price"]])
print(df[["quantity","price"]].mean())
df[["quantity","price"]].apply(lambda x:x-np.mean(x),axis=0)

In [4]:
df1  = pd.DataFrame({'key1': ['a', 'b','e','f'], 'val1': [1, 2,9,10]})
df2 = pd.DataFrame({'key2': ['a', 'b','c','d'], 'val2': [4, 5,6,7]})

print("df1: ")
print(df1)

print("df2")
print(df2)

df1:
  key1  val1
0    a     1
1    b     2
2    e     9
3    f    10
df2
  key2  val2
0    a     4
1    b     5
2    c     6
3    d     7

In [6]:
#inner join
#select * from df1 inner join df2 on df1.key1 = df2.key2
pd.merge(df1,df2,left_on = "key1",right_on="key2")

  key1  val1 key2  val2
0    a     1    a     4
1    b     2    b     5

In [6]:
#left outer join
pd.merge(df1,df2,left_on = "key1",right_on="key2", how = "left")

  key1  val1 key2  val2
0    a     1    a   4.0
1    b     2    b   5.0
2    e     9  NaN   NaN
3    f    10  NaN   NaN

In [7]:
#right outer join
pd.merge(df1,df2,left_on = "key1",right_on="key2", how = "right")

  key1  val1 key2  val2
0    a   1.0    a     4
1    b   2.0    b     5
2  NaN   NaN    c     6
3  NaN   NaN    d     7

In [8]:
#Full outer join
pd.merge(df1,df2,left_on = "key1",right_on="key2", how = "outer")

  key1  val1 key2  val2
0    a   1.0    a   4.0
1    b   2.0    b   5.0
2    e   9.0  NaN   NaN
3    f  10.0  NaN   NaN
4  NaN   NaN    c   6.0
5  NaN   NaN    d   7.0

In [9]:
#Concate on axis 0, one beneath the other
pd.concat([df1,df2],axis = 0)

  key1 key2  val1  val2
0    a  NaN   1.0   NaN
1    b  NaN   2.0   NaN
2    e  NaN   9.0   NaN
3    f  NaN  10.0   NaN
0  NaN    a   NaN   4.0
1  NaN    b   NaN   5.0
2  NaN    c   NaN   6.0
3  NaN    d   NaN   7.0

In [10]:
#Concate on axis 1, side by side
pd.concat([df1,df2],axis = 1)

  key1  val1 key2  val2
0    a     1    a     4
1    b     2    b     5
2    e     9    c     6
3    f    10    d     7

In [11]:
long_data = pd.DataFrame({'Country': ['IN', 'IN', 'IN', 'SL', 'SL', 'SL'],
                         'Year':[1960, 1970, 1990,1960, 1970, 1990  ],
                         'GDPpC': [83, 114, 375, 143, 183,472]})
print(long_data)

  Country  GDPpC  Year
0      IN     83  1960
1      IN    114  1970
2      IN    375  1990
3      SL    143  1960
4      SL    183  1970
5      SL    472  1990

In [17]:
print(long_data.pivot('Country', 'Year', 'GDPpC'))

Year     1960  1970  1990
Country
IN         83   114   375
SL        143   183   472

In [4]:
data = pd.Series([1, -999, 0.5,  0.4])
print(data)

0      1.0
1   -999.0
2      0.5
3      0.4
dtype: float64

In [154]:
data.replace(-999, 0)

0    1.0
1    0.0
2    0.5
3    0.4
dtype: float64

In [155]:
data[ data > -999]

0    1.0
2    0.5
3    0.4
dtype: float64

In [5]:
data > -999

0     True
1    False
2     True
3     True
dtype: bool